In [1]:
"""A database is an organized collection of structured information or data ,typically stored electronically in a comouter system.

Difference between SQL and NoSQL - 
SQL - (1) it is relational database management system.
      (2) structured data can be stored in tables.
      (3) the schemas are static.
      (4) schemas are rigid and bound to relationships.
      (5) helpful to design complex queries.
      
NoSQL- (1) it is used for non relational distributeb database system.
       (2) using JSON data ,unstructured data can be stored.
       (3) the schemas are dynamic.
       (4) schemas are non rigid, they are flexible.
       (5) no interface to prepare complex query."""

'A database is an organized collection of structured information or data ,typically stored electronically in a comouter system.\n\nDifference between SQL and NoSQL - \nSQL - (1) it is relational database management system.\n      (2) structured data can be stored in tables.\n      (3) the schemas are static.\n      (4) schemas are rigid and bound to relationships.\n      (5) helpful to design complex queries.\n      \nNoSQL- (1) it is used for non relational distributeb database system.\n       (2) using JSON data ,unstructured data can be stored.\n       (3) the schemas are dynamic.\n       (4) schemas are non rigid, they are flexible.\n       (5) no interface to prepare complex query.'

In [2]:
"""DDL - Data Defination Language.
This sub_language deals with objects of database like table, indices and users.

CREATE - This command is used to create a new table in SQL.
The user has to give information like table name, column name, and their datatypes.
EXAMPLE -
CREATE TABLE Student_info
(
Collage_Id number(2),
Collage_name varchar(30),
Branch varchar(10)
);

ALTER - This command is used to add ,delete or change columns in the existing tables.
EXAMPLE-
ALTER TABLE Student_info
ADD CGPA number;

TURNCATE - This command is used to remove all rows from the table, but the structure of the table still exists.
EXAMPLE -
TURNCATE TABLE Student_info;

DROP - This command is used to remove an existing table along with its structure from the database.
EXAMPLE - 
DROP TABLE Student_info;"""

'DDL - Data Defination Language.\nThis sub_language deals with objects of database like table, indices and users.\n\nCREATE - This command is used to create a new table in SQL.\nThe user has to give information like table name, column name, and their datatypes.\nEXAMPLE -\nCREATE TABLE Student_info\n(\nCollage_Id number(2),\nCollage_name varchar(30),\nBranch varchar(10)\n);\n\nALTER - This command is used to add ,delete or change columns in the existing tables.\nEXAMPLE-\nALTER TABLE Student_info\nADD CGPA number;\n\nTURNCATE - This command is used to remove all rows from the table, but the structure of the table still exists.\nEXAMPLE -\nTURNCATE TABLE Student_info;\n\nDROP - This command is used to remove an existing table along with its structure from the database.\nEXAMPLE - \nDROP TABLE Student_info;'

In [3]:
"""DML - it is a Data Manipulation Language, which include SQL command that deal with modifying data in a database.
 INSERT -
 This cammand can be used to insert data into a row of table.
 EXAMPLE-
 INSERT INTO Student (Stu_Name, DOB, Phone Mail)
 VALUES('Phoebe', '1998-05-26', 7584567321, 'user@xyz.com');
 
 UPDATE - 
 The UPDATE statement cam be used to update single or multiple columns on the basis of our specific needs.
 EXAMPLE-
 UPDATE Student SET Phone = 3674827728299
 WHERE Stu_Name = 'Phoebe',
 
 DELETE -
 The delete statement can be used inSQL to delete various records from a given table.
 EXAMPLE - 
 DELETE FROM Student WHERE Stu_Name = 'phoebe'."""

"DML - it is a Data Manipulation Language, which include SQL command that deal with modifying data in a database.\n INSERT -\n This cammand can be used to insert data into a row of table.\n EXAMPLE-\n INSERT INTO Student (Stu_Name, DOB, Phone Mail)\n VALUES('Phoebe', '1998-05-26', 7584567321, 'user@xyz.com');\n \n UPDATE - \n The UPDATE statement cam be used to update single or multiple columns on the basis of our specific needs.\n EXAMPLE-\n UPDATE Student SET Phone = 3674827728299\n WHERE Stu_Name = 'Phoebe',\n \n DELETE -\n The delete statement can be used inSQL to delete various records from a given table.\n EXAMPLE - \n DELETE FROM Student WHERE Stu_Name = 'phoebe'."

In [4]:
"""DQL - Data Query Language.
The goal of the DQL commands is to return a schema relation on the basis of query supplied to them.

SELECT statement on a table or collection of table is compiled into a new temporary table.
EXAMPLE - 
SELECT Stu_Name FROM  Student WHERE
Phone = 928637541786;"""

'DQL - Data Query Language.\nThe goal of the DQL commands is to return a schema relation on the basis of query supplied to them.\n\nSELECT statement on a table or collection of table is compiled into a new temporary table.\nEXAMPLE - \nSELECT Stu_Name FROM  Student WHERE\nPhone = 928637541786;'

In [5]:
""" Primary key - it focuses on uniqueness of the table. it assures the value os specific column is unique.
Table allow only one primary key.
The primary key doesn't allow null values.
It can be identify the record uniquely in the database table.
Its restriction can be completely defined on the temporary table.

Foreign key - it is used to build a relationship between the two tables.
Table allow more than one foreign key.
It allow accepts multiple null values.
The value can be deleted from the child table.
Its restriction cannot be defined on the global or local temporary table."""

" Primary key - it focuses on uniqueness of the table. it assures the value os specific column is unique.\nTable allow only one primary key.\nThe primary key doesn't allow null values.\nIt can be identify the record uniquely in the database table.\nIts restriction can be completely defined on the temporary table.\n\nForeign key - it is used to build a relationship between the two tables.\nTable allow more than one foreign key.\nIt allow accepts multiple null values.\nThe value can be deleted from the child table.\nIts restriction cannot be defined on the global or local temporary table."

In [7]:
"""import mysql.connector
# import mysql.connector
#create user 'user'@'%' identified by 'password'
mydb = mysql.connector.connect(
    host= "localhost",
    user="password"
)
print(mydb)
mycursor = mydb.cursor()
mycursor.execute("SHOW DATABASE")
for x in mycursor:
    print(x)
    
cursor.execute(operation,params =  None, multi false)
iterator = cursor.execute(operation, params =none, multi = true)

This method executes the given database operation(query or command).
The parameters found in the touple or dictonary params are bound to the variable in the operation.
Specify variables using %s or %(name)s parameter style (that is ,using format or pyformat style).execute() returns an iterator if multi is true."""

'import mysql.connector\n# import mysql.connector\n#create user \'user\'@\'%\' identified by \'password\'\nmydb = mysql.connector.connect(\n    host= "localhost",\n    user="password"\n)\nprint(mydb)\nmycursor = mydb.cursor()\nmycursor.execute("SHOW DATABASE")\nfor x in mycursor:\n    print(x)\n    \ncursor.execute(operation,params =  None, multi false)\niterator = cursor.execute(operation, params =none, multi = true)\n\nThis method executes the given database operation(query or command).\nThe parameters found in the touple or dictonary params are bound to the variable in the operation.\nSpecify variables using %s or %(name)s parameter style (that is ,using format or pyformat style).execute() returns an iterator if multi is true.'

In [9]:
"""

Select *
FROM dbo.DimProductSubCategory DimSC
INNER JOIN dbo DimProductCategory DimPC
ON DimPC.ProductCategoryKey = DimSC.ProductCategoryKey
WHERE Left (DimSC.EnglishProductSubCategoryName,1) = 'B'
Group by DimPC.EnglishProductCategoryName
Having Count(*) > 1
Order By DimPC.EnglishProductSubcategoryName"""

SyntaxError: invalid syntax (727149446.py, line 1)